In [1]:
import pandas as pd
import numpy as np

In [16]:
df= pd.DataFrame({'Salarié': ['Eric', 'Elise', 'Hapsa', 'Xin'],'Genre' : ['Homme','Femme','Femme','Homme'], 'groupe' : ['Technicien','Ingénieur','PhD','Technicien'],'date_embauche': [2016, 1988, 2012, 2001], 'salaire' : [30000, 100000, 60000,60000]})

In [17]:
df #variables des deux sortes qual et quanti

  Salarié  Genre      groupe  date_embauche  salaire
0    Eric  Homme  Technicien           2016    30000
1   Elise  Femme   Ingénieur           1988   100000
2   Hapsa  Femme         PhD           2012    60000
3     Xin  Homme  Technicien           2001    60000

In [18]:
df1 = df.copy()

In [19]:
pré_traitement = {"groupe":  {"PhD": 1, "Ingénieur": 2, "Technicien": 3 }}
df1.replace(pré_traitement, inplace=True)
df1

  Salarié  Genre  groupe  date_embauche  salaire
0    Eric  Homme       3           2016    30000
1   Elise  Femme       2           1988   100000
2   Hapsa  Femme       1           2012    60000
3     Xin  Homme       3           2001    60000

In [21]:
from sklearn.preprocessing import LabelEncoder
df['groupe_encodé'] = LabelEncoder().fit_transform(df['groupe'])#encodage de la colonne groupe par ordre alpha de base
df

  Salarié  Genre      groupe  date_embauche  salaire  groupe_encodé
0    Eric  Homme  Technicien           2016    30000              2
1   Elise  Femme   Ingénieur           1988   100000              0
2   Hapsa  Femme         PhD           2012    60000              1
3     Xin  Homme  Technicien           2001    60000              2

In [23]:
df['groupe_encodé'] = df['groupe'].map({"PhD": 1, "Ingénieur": 2, "Technicien": 3 })#encodage numérique
df[['groupe','groupe_encodé']]

       groupe  groupe_encodé
0  Technicien              3
1   Ingénieur              2
2         PhD              1
3  Technicien              3

In [24]:
pd.get_dummies(df['Genre'], prefix= 'Genre')#encodage alternatif ONE out permet également de ne pas pondérer une valeur de manière incorrcte

   Genre_Femme  Genre_Homme
0            0            1
1            1            0
2            1            0
3            0            1